In [4]:
import pandas as pd

car_dict = {"BMW" : "X6", "Mahindra" : "Scorpio", "Audi": "A4", "Kia": "Seltos"}
pd.Series(car_dict)

BMW              X6
Mahindra    Scorpio
Audi             A4
Kia          Seltos
dtype: object

In [2]:
#sort it
car_dict2 = pd.Series(car_dict, index=['TATA', 'Mahindra', 'Audi', 'Kia'])
car_dict2

TATA            NaN
Mahindra    Scorpio
Audi             A4
Kia          Seltos
dtype: object

In [3]:
#find null value
car_dict2.isnull()

TATA         True
Mahindra    False
Audi        False
Kia         False
dtype: bool

In [5]:
#data frame
#a dtata frmae is a tabular data structure encapsulating multiple series like coloumn in a spread sheet
#key is called features
dt = pd.DataFrame({'company'   : ['BMW', 'Audi', 'TATA', 'Ford'],
                   'car_sold': [201, 30, 21, 34],
                   'ratting' : [3, 4, 5, 2]})
dt

  company  car_sold  ratting
0     BMW       201        3
1    Audi        30        4
2    TATA        21        5
3    Ford        34        2

In [18]:
#dt.index
#dt.columns
dt.company

0     BMW
1    Audi
2    TATA
3    Ford
Name: company, dtype: object

In [20]:
dt.car_sold

0    201
1     30
2     21
3     34
Name: car_sold, dtype: int64

In [24]:
#iloc = indexed location
dt.iloc[3]
dt.loc[0]

company     BMW
car_sold    201
ratting       3
Name: 0, dtype: object

In [25]:
dt['company'][2] = 'Mahindra'
dt[['company']]

C:\Anaconda New\Anaconda installed files\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

    company
0       BMW
1      Audi
2  Mahindra
3      Ford

In [26]:
dt.loc[3, 'company'] = 'Mercedes'
dt.company

0         BMW
1        Audi
2    Mahindra
3    Mercedes
Name: company, dtype: object

In [41]:
#add ew frame in data frame
import numpy as np
dt['nw col'] = np.arange(1,40, 10)
dt

  company  car_sold  ratting  nw col
0     BMW       201        3       1
1    Audi        30        4      11
2    TATA        21        5      21
3    Ford        34        2      31

In [31]:
#get a numpy array fom dtata FRae
dt.values

array([['BMW', 201, 3, 1],
       ['Audi', 30, 4, 11],
       ['TATA', 21, 5, 21],
       ['Ford', 34, 2, 31]], dtype=object)

In [32]:
dt

  company  car_sold  ratting  nw col
0     BMW       201        3       1
1    Audi        30        4      11
2    TATA        21        5      21
3    Ford        34        2      31

In [65]:
#dt.reindex(dt.index[: : -1])

In [42]:
dt.shape

(4, 4)

In [55]:
#dt[0:3, 0:2]

In [2]:
dt.iloc[0:3, 0:2]
dt

NameError: name 'dt' is not defined

In [67]:
dt.loc[1:3, 'company': 'car_sold']

  company  car_sold
1    Audi        30
2    TATA        21
3    Ford        34

In [6]:
dt

  company  car_sold  ratting
0     BMW       201        3
1    Audi        30        4
2    TATA        21        5
3    Ford        34        2

In [11]:
#sorting valus
dt.sort_values(ascending = False, by="car_sold")
#by defult
#dt.sort_values(ascending = False
dt

  company  car_sold  ratting
0     BMW       201        3
1    Audi        30        4
2    TATA        21        5
3    Ford        34        2

In [16]:
dt.sort_values(by=['car_sold','ratting'], ascending=[True, False])

  company  car_sold  ratting
2    TATA        21        5
1    Audi        30        4
3    Ford        34        2
0     BMW       201        3

In [19]:
dt.drop(['ratting', 'car_sold'], axis= 1, inplace=False)

  company
0     BMW
1    Audi
2    TATA
3    Ford

In [20]:
dt

  company  car_sold  ratting
0     BMW       201        3
1    Audi        30        4
2    TATA        21        5
3    Ford        34        2